INSERT INTO book (title, pub_year, page_count) VALUES
  ('Лунная пыль', '2007-11-05', 400),
  ('Пещинка в небе', '2007-11-05', 549),
  ('Академия и Земля', '2007-11-05', 771),
  ('Звездные дневники Ийона Тихого', '2007-11-05', 1400),
  ('Солярис', '1986-07-16', 354),
  ('Обнаженное солнце', '2007-11-05', 320),
  ('Конец вечности', '2007-11-05', 350),
  ('Горменгаст', '2007-11-05', 680),
  ('Меч Предназначения', '2007-11-05', 398),
  ('Последнее желание', '2007-11-05', 443),
  ('Башня ласточки', '2007-11-05', 316),
  ('Стрелок', '2007-11-05', 417),
  ('Волки Кальи', '2007-11-05', 793),
  ('Темная Башня', '2007-11-05', 818);

UPDATE book
SET created_at = '2017-06-25'::TIMESTAMP
WHERE book_id IN (1, 2, 3);

UPDATE book
SET created_at = '2017-06-26'::TIMESTAMP
WHERE book_id IN (4, 5, 6);

INSERT INTO genre (name) VALUES
  ('Фантастика'), ('Космическая фантастика'), ('Фентези'), ('Ужасы');

UPDATE genre
SET parent_genre = (SELECT genre_id FROM genre WHERE name = 'Фантастика')
WHERE name = 'Космическая фантастика';

INSERT INTO book_genre (book_id, genre_id) VALUES
  (1, 2), (2, 2), (3, 2), (4, 2), (5, 2), (6, 2), (7, 2), (8, 3), (9, 3), (10, 3),
  (11, 3), (12, 4), (13, 4), (14, 4);

INSERT INTO author (name) VALUES
  ('Айзек Азимов'),
  ('Артур Кларк'),
  ('Станислав Лем'),
  ('Анджей Сапковский'),
  ('Стивен Кинг'),
  ('Мервин Пик');

INSERT INTO book_author (book_id, author_id)
VALUES (1, 2), (1, 1), (2, 1), (3, 1), (4, 3), (5, 3), (6, 1), (7, 1), (8, 6), (9, 4),
  (10, 4), (11, 4), (12, 5), (13, 5), (14, 5);

INSERT INTO reader (username, password) VALUES
  ('geoolekom', 'qwerty'),
  ('one', 'qwerty'),
  ('two', 'qwerty');

INSERT INTO book_reader (reader_id, book_id)
VALUES (1, 1), (1, 2), (1, 3), (2, 4), (2, 5), (3, 7);
